# Напишите программу, в которой пользователь будет задавать две строки,
#  программа -  определятьколичество вхождений одной строки в другой.

a = input("Введите а :")
b = input("Введите b :")
print(a.count(b))