# Напишите программу , которая принимает на вход число N
# и выдает последовательность из N чисел


for i in range(int(input("Input your number: "))):
    print((-3) ** i, end = ' ')
    
